#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/h4ystack/tfgh/runs/run-X2Ad4k5P9gDwp4Gn

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
github_repository.dyson: Refreshing state... [id=dyson]
github_repository.tfgh: Refreshing state... [id=tfgh]
github_repository.dotfiles: Refreshing state... [id=dotfiles]
github_branch_protection.tfgh: Refreshing state... [id=BPR_kwDOInxuDs4B6wD3]
github_branch_protection.dotfiles: Refreshing state... [id=BPR_kwDOICFt3s4B6uGN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository.dyson is tainted, so must be replaced
-/+ resource "github_repository" "dyson" {
      - allow_update_branch         = false -> null
      ~ default_branch              = "main" -> (known after apply)
      ~ etag                        = "W/\"71e4a21408fa31c0e8700834035eb1ac0b40ea4d0729ad1787548e7bdf2a0139\"" -> (known after apply)
      ~ full_name                   = "hayas1/dyson" -> (known after apply)
      ~ git_clone_url               = "git://github.com/hayas1/dyson.git" -> (known after apply)
      ~ html_url                    = "https://github.com/hayas1/dyson" -> (known after apply)
      ~ http_clone_url              = "https://github.com/hayas1/dyson.git" -> (known after apply)
      ~ id                          = "dyson" -> (known after apply)
      - is_template                 = false -> null
        name                        = "dyson"
      ~ node_id                     = "R_kgDOIoazQQ" -> (known after apply)
      ~ private                     = false -> (known after apply)
      ~ repo_id                     = 579253057 -> (known after apply)
      ~ ssh_clone_url               = "git@github.com:hayas1/dyson.git" -> (known after apply)
      ~ svn_url                     = "https://github.com/hayas1/dyson" -> (known after apply)
      - topics                      = [] -> null
      - vulnerability_alerts        = false -> null
        # (16 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              + status = "enabled"
            }

          ~ secret_scanning {
              ~ status = "disabled" -> "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

</details>

*Pushed by: @hayas1, Action: `pull_request`*